[{"first_release_date":"11/12/2020","total_rating":73,"esrb":"M","videos":["zsBRGCabaog","aTS9n_m7TW0","3G2JektAKW8","mniWW2haNnY"],"image":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2fb3.jpg","description":"The iconic Black Ops series is back with Call of Duty®: Black Ops Cold War – the direct sequel to the original and fan-favorite Call of Duty®: Black Ops.  Black Ops Cold War will drop fans into the depths of the Cold War’s volatile geopolitical battle of the early 1980s. Nothing is ever as it seems in a gripping single-player Campaign, where players will come face-to-face with historical figures and hard truths, as they battle around the globe through iconic locales like East Berlin, Vietnam, Turkey, Soviet KGB headquarters and more.  As elite operatives, you will follow the trail of a shadowy figure named Perseus who is on a mission to destabilize the global balance of power and change the course of history. Descend into the dark center of this global conspiracy alongside iconic characters Woods, Mason and Hudson and a new cast of operatives attempting to stop a plot decades in the making.  Beyond the Campaign, players will bring a Cold War arsenal of weapons and equipment into the next generation of Multiplayer and Zombies experiences.  Welcome to the brink. Welcome to Call of Duty®: Black Ops Cold War.","story":null,"player_perspectives":["First person"],"multiplayer_modes":{"offlinemax":0,"offlinecoopmax":0,"splitscreen":false},"maxMultiplayer":1,"manual":false,"consoleName":"PC (Microsoft Windows)","consoleId":6,"condition":"Other","case":"none","pricePaid":54,"physical":"","cib":"","datePurchased":"2020-11-13","howAcquired":"Green Man Gaming","notes":"redeemed on Battle.net","createdAt":"11/28/2020 07:23 am","updatedAt":"11/28/2020 07:23 am","_id":"330e45c9787c41239fe84162a3df2f75","name":"Call of Duty: Black Ops Cold War","genres":["Shooter"]},{"first_release_date":"02/14/2019","total_rating":69,"esrb":"M","videos":["6eLHk2Eug78","iVEfKfMXSUs","mc9ORzs23oY"],"image":"https://images.igdb.com/igdb/image/upload/t_cover_big/co1vpg.jpg","description":"Dive into a transformed vibrant post-apocalyptic Hope County, Montana, 17 years after a global nuclear catastrophe. Lead the fight against the Highwaymen, as they seek to take over the last remaining resources.","story":"Seventeen years after a nuclear doomsday, Hope County, Montana, has changed in unexpected ways. Nuclear winter has given way to a \"superbloom,\" creating a lush, colourful landscape that survivors have begun to re-populate with makeshift buildings. It's a lawless frontier where people are struggling to get by - and you'll be able to experience it all with a friend in co-op, or on your own as a lone gunslinger.","player_perspectives":["First person"],"multiplayer_modes":{"offlinemax":0,"offlinecoopmax":0,"splitscreen":false},"maxMultiplayer":1,"manual":false,"consoleName":"PC (Microsoft Windows)","consoleId":6,"condition":"Other","case":"none","pricePaid":8.99,"physical":"","cib":"","datePurchased":"2020-11-26","howAcquired":"Steam","notes":"","createdAt":"11/28/2020 07:25 am","updatedAt":"11/28/2020 07:25 am","_id":"33cceb3db752464e92e786d3f53e8de1","name":"Far Cry New Dawn","genres":["Shooter","Adventure"]},{"first_release_date":"08/19/2013","total_rating":80,"esrb":"M","videos":["8LYfCs5bfyI","pTBPUsDcZgQ","0qhFgMRlgNo"],"image":"https://images.igdb.com/igdb/image/upload/t_cover_big/co1nrn.jpg","description":"Unlike the first three games in the franchise, Saints Row 4 does not center around the main character defeating three rival gangs in order to take over a city. The Saints have now become a household name, and their leader has become the president of the Unites States. The antagonists in Saints Row 4 are an invading alien race known as the Zin. Most of the game takes place within a computer simulation of the city of Steelport controlled by the Zin, where the protagonist is attempting to free himself and his companions.","story":null,"player_perspectives":["Third person"],"multiplayer_modes":{"offlinemax":0,"offlinecoopmax":0,"splitscreen":false},"maxMultiplayer":0,"manual":false,"consoleName":"PC (Microsoft Windows)","consoleId":6,"condition":"Other","case":"none","pricePaid":4.99,"physical":"","cib":"","datePurchased":"2020-11-26","howAcquired":"Steam","notes":"","createdAt":"11/28/2020 07:26 am","updatedAt":"11/28/2020 07:26 am","_id":"0cd9716ebad34850a7a17f07cd7a103f","name":"Saints Row IV","genres":["Shooter","Adventure"]},{"first_release_date":"08/25/2014","total_rating":80,"esrb":"M","videos":["ziDwiguySWo"],"image":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2e1s.jpg","description":"Metro 2033 Redux is the definitive version of the cult classic ‘Metro 2033’, rebuilt in the latest and greatest iteration of the 4A Engine for Next Gen. Fans of the original game will find the unique world of Metro transformed with incredible lighting, physics and dynamic weather effects. Newcomers will get the chance to experience one of the finest story-driven shooters of all time; an epic adventure combining gripping survival horror, exploration and tactical combat and stealth.  All the gameplay improvements and features from the acclaimed sequel ‘Metro: Last Light’ have been transferred to Metro 2033 Redux – superior AI, controls, animation, weapon handling and many more – to create a thrilling experience for newcomers and veterans alike. With two unique play-styles, and the legendary Ranger Mode included, Metro 2033 Redux offers hours of AAA gameplay for an incredible price.","story":"In 2013 the world was devastated by an apocalyptic event, annihilating almost all mankind and turning the Earth's surface into a poisonous wasteland. A handful of survivors took refuge in the depths of the Moscow underground, and human civilization entered a new Dark Age.  The year is 2033. An entire generation has been born and raised underground, and their besieged Metro Station-Cities struggle for survival, with each other, and the mutant horrors that await outside. You are Artyom, born in the last days before the fire, but raised underground. Having never ventured beyond the city limits, one fateful event sparks a desperate mission to the heart of the Metro system, to warn the remnants of mankind of a terrible impending threat.  Your journey takes you from the forgotten catacombs beneath the subway to the desolate wastelands above, where your actions will determine the fate of mankind. But what if the real threat comes from within?","player_perspectives":["First person"],"multiplayer_modes":{"offlinemax":0,"offlinecoopmax":0,"splitscreen":false},"maxMultiplayer":1,"manual":false,"consoleName":"PC (Microsoft Windows)","consoleId":6,"condition":"Other","case":"none","pricePaid":2.99,"physical":"","cib":"","datePurchased":"2020-11-23","howAcquired":"Steam","notes":"","createdAt":"11/28/2020 07:27 am","updatedAt":"11/28/2020 07:27 am","_id":"e2904248f4424f8f94d3010cca7fa7e9","name":"Metro 2033 Redux","genres":["Shooter","Role-playing (RPG)"]},{"first_release_date":"06/28/2013","total_rating":null,"esrb":null,"videos":null,"image":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2ilt.jpg","description":"Hellbound is a limit-removing 32-level megawad created by Zoltán Sófalvi (Z86). Most maps are connected, in that the sense that the end of one map resembles the start area of the next. A second WAD, with the file name \"HBFM29.wad,\" is included, which contains the full version of MAP29. This is because MAP29's extreme level of detail causes heavy drops in frame rate on lower-end computers, particularly in ZDoom-based ports, and the cut-down version in the main WAD attempts to rectify this, though in reality, the difference is negligible.  Hellbound was uploaded to the idgames archive on 29 June, 2013. It was praised for its aesthetic quality, but criticised for its gameplay, which many found to be mostly uninteresting. Due to this, it missed out on a win at the 20th Annual Cacowards, being named as a runner-up instead.","story":null,"player_perspectives":["First person"],"multiplayer_modes":{"offlinemax":0,"offlinecoopmax":0,"splitscreen":false},"maxMultiplayer":1,"manual":false,"consoleName":"PC (Microsoft Windows)","consoleId":6,"condition":"Other","case":"none","pricePaid":4.99,"physical":"","cib":"","datePurchased":"2020-11-25","howAcquired":"Steam","notes":"","createdAt":"11/28/2020 07:28 am","updatedAt":"11/28/2020 07:28 am","_id":"c800803e1c7e42928b32739a65d7f7f4","name":"Hellbound","genres":["Shooter"]},{"first_release_date":"11/14/2013","total_rating":40,"esrb":"E","videos":null,"image":"https://images.igdb.com/igdb/image/upload/t_cover_big/a2yg0m7dc5opg2vpkhgg.jpg","description":"Pool Nation FX, is a seriously fun Pool & Snooker Sim! A visually stunning billiards simulation with the critically acclaimed POOL NATION physics engine. Play 8 Ball, 9 Ball, Snooker, Killer & more, unlimited Career modes with customised difficulty levels, Trickshots, Local and Online Multiplayer and spectate.","story":null,"player_perspectives":[],"multiplayer_modes":{"offlinemax":2,"offlinecoopmax":0,"splitscreen":false},"maxMultiplayer":2,"manual":false,"consoleName":"PC (Microsoft Windows)","consoleId":6,"condition":"Other","case":"none","pricePaid":14.99,"physical":"","cib":"","datePurchased":"2020-11-25","howAcquired":"Steam","notes":"","createdAt":"11/28/2020 07:28 am","updatedAt":"11/28/2020 07:28 am","_id":"bf2081a48bbe4f27ae7cab5c7c4e42b5","name":"Pool Nation FX","genres":["Simulator","Sport","Strategy","Indie"]},{"first_release_date":"01/20/2014","total_rating":75,"esrb":"E","videos":["2FcQVo8MPvY"],"image":"https://images.igdb.com/igdb/image/upload/t_cover_big/co1ihr.jpg","description":"OlliOlli mixes addictive one-life gameplay with over 120 tricks and grinds across 50 deviously crafted levels, 250 Challenges, Spots Mode and Daily Grind. Not enough for you? Complete all challenges to unlock the super skillful RAD Mode! Rack up the biggest and coolest combos along the way then time your landing to perfection to rule the leader-boards. Just don’t slam on your face*. Compete across the world in all modes to get the highest scores on every Level and Spot. Daily Grind gives you 24 hours to challenge the world at a randomly selected Spot. You can practice as many times as you like, but you only get one chance to set your score.","story":null,"player_perspectives":["Side view"],"multiplayer_modes":{"offlinemax":0,"offlinecoopmax":0,"splitscreen":false},"maxMultiplayer":1,"manual":false,"consoleName":"PC (Microsoft Windows)","consoleId":6,"condition":"Other","case":"none","pricePaid":1.99,"physical":"","cib":"","datePurchased":"2020-11-25","howAcquired":"GOG","notes":"","createdAt":"11/28/2020 07:29 am","updatedAt":"11/28/2020 07:29 am","_id":"e4e23aef856e44dd8c266f984995feab","name":"OlliOlli","genres":["Platform","Sport","Indie"]},{"first_release_date":"03/02/2015","total_rating":78,"esrb":"E","videos":["Vmkspv2Do_s","tnCUw-r68qw","K56SXPKx5pQ"],"image":"https://images.igdb.com/igdb/image/upload/t_cover_big/co1ihs.jpg","description":"Drop in to Olliwood and prepare for finger-flippin’ mayhem in this follow up to cult skateboarding smashOlliOlli. The iconic skater is going all green-screen with a stunning new look, plucking you from the street and dropping you squarely in the middle of the big screen’s most bodacious cinematic locations.","story":null,"player_perspectives":["Side view"],"multiplayer_modes":{"offlinemax":0,"offlinecoopmax":0,"splitscreen":false},"maxMultiplayer":0,"manual":false,"consoleName":"PC (Microsoft Windows)","consoleId":6,"condition":"Other","case":"none","pricePaid":1.99,"physical":"","cib":"","datePurchased":"2020-11-25","howAcquired":"GOG","notes":"","createdAt":"11/28/2020 07:30 am","updatedAt":"11/28/2020 07:30 am","_id":"ec91f1ba5d884133859ca0e4f629044e","name":"OlliOlli2: Welcome to Olliwood","genres":["Platform","Sport","Indie"]},{"first_release_date":"08/25/2014","total_rating":79,"esrb":"M","videos":["ziDwiguySWo"],"image":"https://images.igdb.com/igdb/image/upload/t_cover_big/co20bk.jpg","description":"Metro: Last Light Redux is the definitive version of the critically acclaimed ‘Metro: Last Light’, rebuilt in the latest and greatest iteration of the 4A Engine for Next Gen. Newcomers will get the chance to experience one of the finest story-driven shooters of all time; an epic adventure combining gripping survival horror, exploration and tactical combat and stealth.  This definitive version also includes all previously released DLC, adding 10 hours of bonus single-player content to the huge solo campaign. Fans of the original game will notice new features and gameplay improvements, including new melee animations, the ability to check your watch and ammo supplies on the fly, and new full-body player animations.  And those who favoured the more survival-horror oriented gameplay of the cult prequel ‘Metro 2033’ will find a new way to experience the campaign thanks to the introduction of two unique Play Styles – Survival and Spartan. The former transforms Last light from a more action-oriented stealth combat experience to a fraught, slow burn fight for survival. With the legendary Ranger Mode included to offer an extra layer of challenge and immersion, Metro: Last Light Redux offers hours of AAA gameplay for an incredible price.  Game Features  Immerse yourself in the Moscow Metro - witness one of the most atmospheric worlds in gaming brought to life with stunning next-gen visuals at 60FPS Brave the horrors of the Russian apocalypse - equip your gasmask and an arsenal of hand-made weaponry as you face the threat of deadly mutants, human foes, and the terrifying environment itself    Rebuilt and Remastered for next-gen - with all previous DLC content included, new modes and features, and many gameplay improvement, this is the definitive version of the critically acclaimed classic that fans and newcomers alike will enjoy    Two unique Play Styles : \"Spartan\" and \"Survival\" - approach the game as a slow burn Survival Horror, or tackle it with the combat skills of a Spartan Ranger in these two unique modes    The legendary Ranger Mode returns - dare you play the fearsome Ranger Mode? No HUD, UI, deadlier combat and limited resources combine to create the ultimate immersive experience   Based on the internationally bestselling novel series by Dmitry Glukhovsky","story":"The humanity, at least what remains of it, managed to eke out one more year of survival – it is year 2034 now. The mutants still roam the desolate remains of Moscow above and the dark abandoned tunnels around. The resources are even scarcer, but there is still hope – the huge D6 bunker you, Artyom, and your comrades discovered while on your quest to rid the Metro of mortal danger. In its vast expanse it might contain the key to survival; it might hold incredible stores of supplies which the survivors are running out of.  It might be the salvation – but it could also bring about the complete ruin of humanity, for the factions within Metro are gearing up for an all-out war for whatever it might contain. This one could well become the War to End All Wars, since after it ends there will probably be no one to wage war anymore. It truly is the dusk of humanity – and dusk leads to the nigh. Night, which is going to last forever this time.  Will you be able to avert the impending doom? Will you find courage and understanding to right the wrongs that you did and save humanity from itself? Will you even survive?","player_perspectives":["First person"],"multiplayer_modes":{"offlinemax":0,"offlinecoopmax":0,"splitscreen":false},"maxMultiplayer":1,"manual":false,"consoleName":"PC (Microsoft Windows)","consoleId":6,"condition":"Other","case":"none","pricePaid":3,"physical":"","cib":"","datePurchased":"2020-11-27","howAcquired":"GOG","notes":"","createdAt":"11/28/2020 07:32 am","updatedAt":"11/28/2020 07:32 am","_id":"8d52985094de4fc58cd454b49e898d9b","name":"Metro: Last Light Redux","genres":["Shooter","Role-playing (RPG)"]},{"first_release_date":"11/18/2001","total_rating":74,"esrb":"M","videos":["9UJGNUb5RnE","2TcR43AhVo0"],"image":"https://images.igdb.com/igdb/image/upload/t_cover_big/co1xzr.jpg","description":"Return to Castle Wolfenstein is a first-person shooter and a reboot of Wolfenstein 3D. The player's arsenal includes among others a Luger, MP 40 submachine gun, Mauser rifle with sniper scope, flamethrower, dynamite and grenades. The game also features a multiplayer component in which players are split into Axis and Allies sides with each a set of objectives to complete.","story":"World War II rages and nations fall. SS head Himmler has Hitler's full backing to twist science and the occult into an army capable of annihilating the Allies once and for all. Battling alone, you're on an intense mission to pierce the black heart of the Third Reich and stop Himmler... or die trying.","player_perspectives":["First person"],"multiplayer_modes":{"offlinemax":0,"offlinecoopmax":0,"splitscreen":false},"maxMultiplayer":1,"manual":false,"consoleName":"PC (Microsoft Windows)","consoleId":6,"condition":"Other","case":"none","pricePaid":2,"physical":"","cib":"","datePurchased":"2020-11-27","howAcquired":"GOG","notes":"","createdAt":"11/28/2020 07:32 am","updatedAt":"11/28/2020 07:32 am","_id":"aea488f8a93749ea933d25c5d785373d","name":"Return to Castle Wolfenstein","genres":["Shooter"]},{"first_release_date":"10/04/2016","total_rating":69,"esrb":"M","videos":["FhoQljEmEP0"],"image":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2kns.jpg","description":"BUTCHER is a fast-paced 2D shooter game and a blood-soaked love letter to the early 90s. As a cyborg programmed to eradicate the last remains of humanity, your sole purpose is to well... annihilate anything that moves.  So grab your weapon of choice (from chainsaw, through shotgun, to grenade launcher) and kill your way through underground hideouts, post-apocalyptic cities, jungles and more. And if you're feeling creative, there are plenty other ways of ending your enemies' misery - hooks, lava pits, saws... no death will ever be the same.","story":null,"player_perspectives":["Side view"],"multiplayer_modes":{"offlinemax":0,"offlinecoopmax":0,"splitscreen":false},"maxMultiplayer":1,"manual":false,"consoleName":"PC (Microsoft Windows)","consoleId":6,"condition":"Other","case":"none","pricePaid":0,"physical":"","cib":"","datePurchased":"2020-11-23","howAcquired":"GOG","notes":"","createdAt":"11/28/2020 07:34 am","updatedAt":"11/28/2020 07:34 am","_id":"c62e4fbb2c47497ba9ae71ac9d40e8e0","name":"BUTCHER","genres":["Shooter","Platform","Indie","Arcade"]},{"first_release_date":"11/21/2012","total_rating":77,"esrb":null,"videos":["7tcxT_WxItE","NNKDJMv2eLY"],"image":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2213.jpg","description":"In a cold, dark future dominated by mega-corporations, a small lonely planet on the edge of habitable space is the site of a shadowy research facility specializing in necrotic tissue reactivation. You are a scientist who has suddenly awoken to the realization that you are the lone survivor. The rest of the facility’s personnel have all been killed – micro-chipped and reactivated as combatants by the facility’s central processing AI.  Teleglitch: Die More Edition is a roguelike top-down shooter with retro pixel graphics. Featuring procedurally generated maps that change with each play through, you will never experience the same facility twice. Clutch your gun, walk down the dark corridors and enter each new room hoping those last few rounds of ammunition will be enough. Feel the anxiety, the paranoia and the sheer terror of Teleglitch.  Teleglitch: Die More Edition is an enhanced version of Teleglitch. Compared to the original game there are five bonus levels, additional items and weapons, improved AI and expanded dossiers and lore content.","story":null,"player_perspectives":["Bird view / Isometric"],"multiplayer_modes":{"offlinemax":0,"offlinecoopmax":0,"splitscreen":false},"maxMultiplayer":1,"manual":false,"consoleName":"PC (Microsoft Windows)","consoleId":6,"condition":"Other","case":"none","pricePaid":0,"physical":"","cib":"","datePurchased":"2020-11-16","howAcquired":"GOG","notes":"","createdAt":"11/28/2020 07:35 am","updatedAt":"11/28/2020 07:35 am","_id":"e8814ecf98ae4c66ac869850cc2cf6e1","name":"Teleglitch: Die More Edition","genres":["Shooter","Adventure","Indie"]},{"first_release_date":"11/09/2015","total_rating":82,"esrb":"M","videos":["2Xer46PlBlc","qeu4fFyRXLA","X5aJfebzkrM","R-p0NoeQZ4g"],"image":"https://images.igdb.com/igdb/image/upload/t_cover_big/co1yc6.jpg","description":"Bethesda Game Studios, the award-winning creators of Fallout 3 and The Elder Scrolls V: Skyrim, welcome you to the world of Fallout 4 – their most ambitious game ever, and the next generation of open-world gaming.","story":null,"player_perspectives":["First person","Third person"],"multiplayer_modes":{"offlinemax":0,"offlinecoopmax":0,"splitscreen":false},"maxMultiplayer":0,"manual":false,"consoleName":"PC (Microsoft Windows)","consoleId":6,"condition":"Other","case":"none","pricePaid":8.99,"physical":"","cib":"","datePurchased":"2020-11-27","howAcquired":"Steam","notes":"","createdAt":"11/28/2020 07:41 am","updatedAt":"11/28/2020 07:41 am","_id":"53d1ab25b32343be8fabaecd65657ee1","name":"Fallout 4","genres":["Shooter","Role-playing (RPG)"]},{"first_release_date":"12/02/1996","total_rating":67,"esrb":"T","videos":["3yjqaeO14c4","8arRt8aDS0M","x8xNSgSof2E"],"image":"https://images.igdb.com/igdb/image/upload/t_cover_big/co25xv.jpg","description":"As Luke Skywalker and the Rebel Alliance struggle to defeat Darth Vader and the Empire, a new threat arises. Dark Prince Xizor aspires to take Darth Vader's place at the Emperor's side. As Dash Rendar, it's up to you to protect Luke and help the Alliance. May the Force be with you!","story":null,"player_perspectives":["Third person"],"multiplayer_modes":{"offlinemax":0,"offlinecoopmax":0,"splitscreen":false},"maxMultiplayer":1,"manual":false,"consoleName":"PC (Microsoft Windows)","consoleId":6,"condition":"Other","case":"none","pricePaid":2.09,"physical":"","cib":"","datePurchased":"2020-11-27","howAcquired":"Steam","notes":"","createdAt":"11/28/2020 07:42 am","updatedAt":"11/28/2020 07:42 am","_id":"a7df34c4d11c4413b80d958f8e53de3f","name":"Star Wars: Shadows of the Empire","genres":["Shooter","Adventure"]},{"first_release_date":"08/20/2013","total_rating":67,"esrb":"T","videos":null,"image":"https://images.igdb.com/igdb/image/upload/t_cover_big/co1si8.jpg","description":"Flashback is a science fiction platform video game remake of the original 1992 Flashback. The game was developed by the original game designer, Paul Cuisset, with his studio, VectorCell, and published by Ubisoft. The game was released on August 21, 2013 on Xbox Live Arcade.","story":"The game begins with the protagonist, who tried to escape from Cyborgs using a jetbike. Unfortunately his vehicle got severely damaged and crashes in a jungle of Titan. He wakes up after a while, finds a gun and retrieves a holocube later on. His own hologram tells he is Conrad B. Hart, and he has to go find Ian in New Washington, telling he's not safe. After a little journey in the jungle, he meets Bolton, and asks to find his teleporter for medical assistance. After retrieving the teleporter, he teleports as he leaves his own ID card. After venturing for a while, Conrad meets Joe, he tells that New Washington is down the hole behind him, but an Anti-Gravity Belt is needed. To have it, he asks for several Grenada fruits. After swapping what they both want, Conrad jumps into the hole and activates the belt to safely arrive in New Washington.Near Ian's place, he overhears a Cyborg interrogating him about a neurophage. After saving him, he gives a part of his memory back and gives a force field to protect him from bullets. Conrad then checks his GBI Virtual Reality with a virtual professor, who mocks him and tells him his own cryptic location. He finds a Memory Flash at the place, to find out about a deal with aliens in disguise in Death Tower. Conrad asks Joe a new identity for the Death Tower TV show. Joe tells the cost is 1500 credits, and points out the Administration Center to get a Work Permit for a salary. He uses Bolton's ID card to get a Work Permit. After doing his first job, he gets another Memory Flash, about a meeting between him and the real professor, telling him the Earth is being quietly invaded by aliens nicknamed Morphs. He then talks about a neurophage that he made to destroy them all. As he performs other jobs, he finds other pieces of his memory back as well as instructions to find the neurophage and its activator. With all the salary he got from performing jobs, he buys what he wanted from Joe, and enters the Death Tower TV show as Jay Carpenter.After winning the show and getting a ticket to Earth, Conrad talks to the announcer about finishing up the deal. The disguised morph then reveals they have the new senator and Sonia, Conrad's girlfriend, and awaits them to be absorbed by The Mind. After killing the announcer, he uses the ticket to Earth to save Sonia and the planet.Eventually, he is arrested in Earth's spaceport by corrupted cyborg cops, but manages to get out. He meets Ian again, who says that erasing his own memory to fool them didn't work, reminding him that he gave his first flashback, and reveals that he's a Morph, and the Morphs' goal: To perfect humanity as being a powerful entity. He gives to Conrad his painful last Flashback: showing that he had a very risky plan to go to the Morphs' homeworld. He then drives a jetbike, and asks Bolton where is the senator, and talks about the Paradise Club. When he goes there, he witnesses a meeting between the senator and the Morphs, who absorbed him, and talks about the Earth's colonisation. The vent where he stands for fell by his weight and is imprisoned by them. He manages to escape and meets Ian once more, and kills him. He finds a teleporter which leads him to their homeworld.After being teleported, he frees the professor from his prison, and tells Conrad to get rid of an auxiliary brain so he can save Sonia. After that, he tells him to destroy The Mind, and use the neurophage in the planet's core. As he meets The Mind, it tries to persuade Conrad into being absorbed by him, only to get mocked at, and says he prefers being himself. After destroying it, Conrad releases the neurophage. As he tells Sonia that he's sorry, the professor tells Conrad to run as there is a spacecraft not far away.Conrad manages to leave the Morph Planet alive as it explodes with the spacecraft. He tries to find where he is in the map, only to find out that his position is unknown. Unhappy, as he goes to his room, his holocube shows a hologram of Conrad congratulating him. Conrad then enters into suspended animation as the spacecraft goes. The credits shows the cutscenes, including one when the suspended animation ends as he wakes up. The post-credits cutscene is a discussion between some of the characters, with Sonia feeling that Conrad is still alive.","player_perspectives":["Side view"],"multiplayer_modes":{"offlinemax":0,"offlinecoopmax":0,"splitscreen":false},"maxMultiplayer":1,"manual":false,"consoleName":"PC (Microsoft Windows)","consoleId":6,"condition":"Other","case":"none","pricePaid":2,"physical":"","cib":"","datePurchased":"2020-11-27","howAcquired":"GOG","notes":"","createdAt":"12/01/2020 05:59 am","updatedAt":"12/01/2020 05:59 am","_id":"ca1be62e63134eec85c0e175fbb9adf1","name":"Flashback","genres":["Platform","Role-playing (RPG)","Adventure"]}]