[{"id":7360,"first_release_date":"11/30/2015","total_rating":78,"esrb":"M","videos":["5DX0xjmIWWM","qRaLYOWPqyA","IOPjrDUuXaQ","N7sufn_qnDM","yFAT9U64cuY","waTdua8gpDc","F-6S7hu0wYc","jYEuI0CTSH4","hhOgDFA-7L4","Vuj07o8D8LY","Cz05pYI0dIc","C61bhu8eI3o","lGYu0mSHMMQ"],"image":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2a1y.jpg","description":"Inspired by the reality of counter terrorist operatives across the world, Rainbow Six Siege invites players to master the art of destruction. Intense close quarters confrontations, high lethality, tactics, team play, and explosive action are at the center of the experience. The multiplayer gameplay of Rainbow Six Siege sets a new bar for intense firefights and expert strategy in the rich legacy of past Rainbow Six games.","story":null,"player_perspectives":["First person"],"multiplayer_modes":{"offlinemax":0,"offlinecoopmax":0,"splitscreen":false},"maxMultiplayer":0,"manual":false,"compilation":false,"compilationGamesIds":[],"gamesService":{"xbGold":false,"xbPass":false,"psPlus":false,"primeFree":false},"consoleName":"PC (Microsoft Windows)","consoleId":6,"condition":"Other","case":"none","pricePaid":8.99,"physical":"","cib":"","datePurchased":"2020-12-18","howAcquired":"Green Man Gaming","notes":"redeemed on Ubisoft Connect","createdAt":"12/19/2020 07:09 am","updatedAt":"12/19/2020 07:09 am","_id":"84cc0b566fd14575b74f63f965d4b590","name":"Tom Clancy's Rainbow Six Siege","extraData":[],"extraDataFull":[],"genres":["Shooter","Tactical","FPS"],"location":"upstairs","handheld":false},{"id":28552,"first_release_date":"03/26/2018","total_rating":80,"esrb":"M","videos":["m1kF9rz2ric","invCtVgUlyA","hJHLjaqhmyY","q2Ma9HstasU","imKO65TTBBo","DW6lQSwL8oA","65eh4YdWfHI","P3La92ethq4","TgT2r-hB4pw","UA4KoqTICog","-Se1hEYRDik","ZOSesIeUHCM"],"image":"https://images.igdb.com/igdb/image/upload/t_cover_big/co21a6.jpg","description":"Welcome to Hope County, Montana, land of the free and the brave, but also home to a fanatical doomsday cult known as The Project at Eden’s Gate that is threatening the community's freedom. Stand up to the cult’s leader, Joseph Seed and the Heralds, and spark the fires of resistance that will liberate the besieged community.    In this expansive world, your limits and creativity will be tested against the biggest and most ruthless baddest enemy Far Cry has ever seen. It’ll be wild and it’ll get weird, but as long as you keep your wits about you, the residents of Hope County can rest assured knowing you’re their beacon of hope.","story":"The game is set in the fictional Hope County, Montana, where a preacher named Joseph Seed has risen to prominence in the region. Seed believes that he has been chosen to protect the people of Hope County from an \"inevitable collapse\" and has established a congregation called Eden's Gate. Ostensibly, this is to fulfill his mission of leading the people to salvation; in reality, Seed is a radical preacher and Eden's Gate is a militaristic doomsday cult. Under his rule, Eden's Gate has used both coercion and violence to forcibly convert the residents of Hope County, and intimidation to keep them from contacting the federal government for help. When an attempt to arrest Seed ends with the deaths of several lawmen, the player is swept into the armed conflict between Eden's Gate and the remaining Hope County residents who are organizing themselves into a resistance movement. The player takes on the role of a sheriff's deputy who is sent to Hope County to arrest Seed. Seed has assumed the title of \"the Father\" and maintains control over Hope County with the aid of his siblings, known as \"the Heralds\": Jacob, a former military officer that oversees their armed soldiers; John, a lawyer that has been able to acquire much of the land in Hope County for Eden's Gate; and Faith, who acts as a pacifist to bring the people to believe and trust in her older brother. The residents of Hope County opposed to Seed include Pastor Jerome, a local church leader that has seen his congregation taken by Eden's Gate; Mary May, a bartender whose father was murdered by the cult; and Nick Rye, a cropduster pilot who wants to eliminate the influence of the cult in order to build a better future for his children.","player_perspectives":["First person"],"multiplayer_modes":{"offlinemax":0,"offlinecoopmax":0,"splitscreen":false},"maxMultiplayer":0,"manual":false,"compilation":false,"compilationGamesIds":[],"gamesService":{"xbGold":false,"xbPass":false,"psPlus":false,"primeFree":false},"consoleName":"PC (Microsoft Windows)","consoleId":6,"condition":"Other","case":"none","pricePaid":8.99,"physical":"","cib":"","datePurchased":"2020-12-18","howAcquired":"Epic Games Store","notes":"Gold Edition","createdAt":"12/19/2020 07:10 am","updatedAt":"12/19/2020 07:10 am","_id":"5bb4147a0cfc4257afa546aa7cb948c0","name":"Far Cry 5","extraData":[],"extraDataFull":[],"genres":["Shooter","Adventure","FPS","Open world"],"location":"upstairs","handheld":false}]