[
  {
    "id": 137001,
    "esrb": "M",
    "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co2fb3.jpg",
    "first_release_date": "11/13/2020",
    "genres": ["Shooter", "FPS"],
    "name": "Call of Duty: Black Ops Cold War",
    "player_perspectives": ["First person"],
    "description": "The iconic Black Ops series is back with Call of Duty®: Black Ops Cold War – the direct sequel to the original and fan-favorite Call of Duty®: Black Ops. Black Ops Cold War will drop fans into the depths of the Cold War’s volatile geopolitical battle of the early 1980s. Nothing is ever as it seems in a gripping single-player Campaign, where players will come face-to-face with historical figures and hard truths, as they battle around the globe through iconic locales like East Berlin, Vietnam, Turkey, Soviet KGB headquarters and more. As elite operatives, you will follow the trail of a shadowy figure named Perseus who is on a mission to destabilize the global balance of power and change the course of history. Descend into the dark center of this global conspiracy alongside iconic characters Woods, Mason and Hudson and a new cast of operatives attempting to stop a plot decades in the making. Beyond the Campaign, players will bring a Cold War arsenal of weapons and equipment into the next generation of Multiplayer and Zombies experiences. Welcome to the brink. Welcome to Call of Duty®: Black Ops Cold War.",
    "total_rating": 76.0,
    "videos": ["zsBRGCabaog", "aTS9n_m7TW0", "3G2JektAKW8", "mniWW2haNnY"],
    "story": null,
    "physical": false,
    "cib": false,
    "manual": false,
    "howAcquired": "Green Man Gaming",
    "notes": "redeemed through Battle.net",
    "pricePaid": 54,
    "case": "none",
    "condition": "other",
    "datePurchased": "2020-11-13",
    "consoleName": "PC (Microsoft Windows)",
    "consoleId": 6,
    "maxMultiplayer": 1
  },
  {
    "id": 113111,
    "esrb": "M",
    "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co1vpg.jpg",
    "first_release_date": "02/15/2019",
    "genres": ["Shooter", "FPS", "Adventure"],
    "name": "Far Cry: New Dawn",
    "player_perspectives": ["First person"],
    "description": "Dive into a transformed vibrant post-apocalyptic Hope County, Montana, 17 years after a global nuclear catastrophe. Lead the fight against the Highwaymen, as they seek to take over the last remaining resources.",
    "total_rating": 69.2,
    "videos": ["6eLHk2Eug78", "iVEfKfMXSUs", "mc9ORzs23oY"],
    "story": "Seventeen years after a nuclear doomsday, Hope County, Montana, has changed in unexpected ways. Nuclear winter has given way to a \"superbloom,\" creating a lush, colourful landscape that survivors have begun to re-populate with makeshift buildings. It's a lawless frontier where people are struggling to get by - and you'll be able to experience it all with a friend in co-op, or on your own as a lone gunslinger.",
    "physical": false,
    "cib": false,
    "manual": false,
    "howAcquired": "Steam",
    "notes": "Deluxe Edition",
    "pricePaid": 8.99,
    "case": "none",
    "condition": "other",
    "datePurchased": "2020-11-26",
    "consoleName": "PC (Microsoft Windows)",
    "consoleId": 6,
    "maxMultiplayer": 1
  },
  {
    "id": 1981,
    "esrb": "M",
    "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co1nrn.jpg",
    "first_release_date": "08/20/2013",
    "genres": ["Shooter", "Adventure"],
    "name": "Saints Row IV",
    "player_perspectives": ["Third person"],
    "description": "Unlike the first three games in the franchise, Saints Row 4 does not center around the main character defeating three rival gangs in order to take over a city. The Saints have now become a household name, and their leader has become the president of the Unites States. The antagonists in Saints Row 4 are an invading alien race known as the Zin. Most of the game takes place within a computer simulation of the city of Steelport controlled by the Zin, where the protagonist is attempting to free himself and his companions.",
    "total_rating": 79.9,
    "videos": ["6eLHk2Eug78", "iVEfKfMXSUs", "mc9ORzs23oY"],
    "story": null,
    "physical": false,
    "cib": false,
    "manual": false,
    "howAcquired": "Steam",
    "notes": "",
    "pricePaid": 4.99,
    "case": "none",
    "condition": "other",
    "datePurchased": "2020-11-26",
    "consoleName": "PC (Microsoft Windows)",
    "consoleId": 6,
    "offlinecoopmax": 0,
    "offlinemax": 0,
    "splitscreen": false,
    "maxMultiplayer": 1
  },
  {
    "id": 80853,
    "esrb": "M",
    "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co2e1s.jpg",
    "first_release_date": "08/25/2014",
    "genres": ["Shooter", "Role-playing (RPG)", "FPS"],
    "name": "Metro 2033 Redux",
    "player_perspectives": ["First person"],
    "description": "Metro 2033 Redux is the definitive version of the cult classic ‘Metro 2033’, rebuilt in the latest and greatest iteration of the 4A Engine for Next Gen. Fans of the original game will find the unique world of Metro transformed with incredible lighting, physics and dynamic weather effects. Newcomers will get the chance to experience one of the finest story-driven shooters of all time; an epic adventure combining gripping survival horror, exploration and tactical combat and stealth. \n \nAll the gameplay improvements and features from the acclaimed sequel ‘Metro: Last Light’ have been transferred to Metro 2033 Redux – superior AI, controls, animation, weapon handling and many more – to create a thrilling experience for newcomers and veterans alike. With two unique play-styles, and the legendary Ranger Mode included, Metro 2033 Redux offers hours of AAA gameplay for an incredible price.",
    "total_rating": 79.8,
    "videos": ["ziDwiguySWo"],
    "story": "In 2013 the world was devastated by an apocalyptic event, annihilating almost all mankind and turning the Earth's surface into a poisonous wasteland. A handful of survivors took refuge in the depths of the Moscow underground, and human civilization entered a new Dark Age. \n \nThe year is 2033. An entire generation has been born and raised underground, and their besieged Metro Station-Cities struggle for survival, with each other, and the mutant horrors that await outside. You are Artyom, born in the last days before the fire, but raised underground. Having never ventured beyond the city limits, one fateful event sparks a desperate mission to the heart of the Metro system, to warn the remnants of mankind of a terrible impending threat. \n \nYour journey takes you from the forgotten catacombs beneath the subway to the desolate wastelands above, where your actions will determine the fate of mankind. But what if the real threat comes from within?",
    "physical": false,
    "cib": false,
    "manual": false,
    "howAcquired": "Steam",
    "notes": "",
    "pricePaid": 2.99,
    "case": "none",
    "condition": "other",
    "datePurchased": "2020-11-23",
    "consoleName": "PC (Microsoft Windows)",
    "consoleId": 6,
    "maxMultiplayer": 1
  },
  {

    "id": 139990,
    "esrb": "M",
    "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co2ilt.jpg",
    "first_release_date": "08/04/2020",
    "genres": ["Shooter", "FPS", "Indie"],
    "name": "Hellbound",
    "player_perspectives": ["First person"],
    "description": "Hellbound is a limit-removing 32-level megawad created by Zoltán Sófalvi (Z86). Most maps are connected, in that the sense that the end of one map resembles the start area of the next. A second WAD, with the file name \"HBFM29.wad,\" is included, which contains the full version of MAP29. This is because MAP29's extreme level of detail causes heavy drops in frame rate on lower-end computers, particularly in ZDoom-based ports, and the cut-down version in the main WAD attempts to rectify this, though in reality, the difference is negligible. \n \nHellbound was uploaded to the idgames archive on 29 June, 2013. It was praised for its aesthetic quality, but criticised for its gameplay, which many found to be mostly uninteresting. Due to this, it missed out on a win at the 20th Annual Cacowards, being named as a runner-up instead.",
    "total_rating": 70,
    "videos": ["0FSedMKJQ4w"],
    "story": null,
    "physical": false,
    "cib": false,
    "manual": false,
    "howAcquired": "Steam",
    "notes": "",
    "pricePaid": 4.99,
    "case": "none",
    "condition": "other",
    "datePurchased": "2020-11-25",
    "consoleName": "PC (Microsoft Windows)",
    "consoleId": 6,
    "maxMultiplayer": 1
  },
  {

    "id": 17645,
    "esrb": "E",
    "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/a2yg0m7dc5opg2vpkhgg.jpg",
    "first_release_date": "08/04/2020",
    "genres": ["Simulator", "Sport", "Strategy", "Pool", "Indie"],
    "name": "Pool Nation FX",
    "player_perspectives": ["First person"],
    "description": "Pool Nation FX, is a seriously fun Pool & Snooker Sim! A visually stunning billiards simulation with the critically acclaimed POOL NATION physics engine. Play 8 Ball, 9 Ball, Snooker, Killer & more, unlimited Career modes with customised difficulty levels, Trickshots, Local and Online Multiplayer and spectate.",
    "total_rating": 40,
    "videos": [],
    "story": null,
    "physical": false,
    "cib": false,
    "manual": false,
    "howAcquired": "Steam",
    "notes": "",
    "pricePaid": 14.99,
    "case": "none",
    "condition": "other",
    "datePurchased": "2020-11-25",
    "consoleName": "PC (Microsoft Windows)",
    "consoleId": 6,
    "maxMultiplayer": 2,
    "offlinemax": 2,
    "offlinecoopmax": 0,
    "splitscreen": false
  },
  {
    "id": 7768,
    "esrb": "E",
    "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co1ihr.jpg",
    "first_release_date": "07/22/2014",
    "genres": ["Sport", "Platform", "Skateboarding", "Indie"],
    "name": "OlliOlli",
    "player_perspectives": ["Side View"],
    "description": "OlliOlli mixes addictive one-life gameplay with over 120 tricks and grinds across 50 deviously crafted levels, 250 Challenges, Spots Mode and Daily Grind. Not enough for you? Complete all challenges to unlock the super skillful RAD Mode! Rack up the biggest and coolest combos along the way then time your landing to perfection to rule the leader-boards. Just don’t slam on your face*. Compete across the world in all modes to get the highest scores on every Level and Spot. Daily Grind gives you 24 hours to challenge the world at a randomly selected Spot. You can practice as many times as you like, but you only get one chance to set your score.",
    "total_rating": 74.5,
    "videos": ["2FcQVo8MPvY"],
    "story": null,
    "physical": false,
    "cib": false,
    "manual": false,
    "howAcquired": "Steam",
    "notes": "",
    "pricePaid": 1.99,
    "case": "none",
    "condition": "other",
    "datePurchased": "2020-11-25",
    "consoleName": "PC (Microsoft Windows)",
    "consoleId": 6,
    "maxMultiplayer": 1
  }
]